In [1]:
import wget
import gzip
import pandas as pd
from sqlalchemy import create_engine
import numpy as np
import os

### DOWNLOAD FILES FROM IMBD

URL to files:

In [2]:
title_basics_URL = 'https://datasets.imdbws.com/title.basics.tsv.gz'
title_principals_URL = 'https://datasets.imdbws.com/title.principals.tsv.gz'
title_ratings_URL = 'https://datasets.imdbws.com/title.ratings.tsv.gz'
name_basics_URL = 'https://datasets.imdbws.com/name.basics.tsv.gz'

Downloading files:

In [ ]:
wget.download(title_basics_URL, 'downloads/title.basics.tsv.gz')

wget.download(title_principals_URL, 'downloads/title.principals.tsv.gz')

wget.download(title_ratings_URL, 'downloads/title.ratings.tsv.gz')

wget.download(name_basics_URL, 'downloads/name.basics.tsv.gz')

### Setting conection to db

In [3]:
#ENV VARIABLES:
password = os.getenv('POSTGRES_PASSWORD')
host = os.getenv('HOST_DB')
db_name = os.getenv('POSTGRES_DB')

engine = create_engine(f"""postgresql://postgres:{password}@postgres-db:{host}/{db_name}"""
                          )  # create engine
con = engine.connect()  # get connection to db

### Create DB with ratings

In [4]:
title_ratings_file = gzip.open('downloads/title.ratings.tsv.gz','rb') # opening file

In [5]:
con.execute(f"""DROP TABLE IF EXISTS public.title_ratings; 
        CREATE TABLE if not exists public.title_ratings (
        tconst character varying PRIMARY KEY,
        averagerating decimal,
        numvotes decimal);
        """)

In [6]:
pd.read_sql_query("SELECT column_name FROM information_schema.columns where table_name = 'title_ratings';", con)

     column_name
0         tconst
1  averagerating
2       numvotes

In [7]:
for chunk in pd.read_csv(title_ratings_file, delim_whitespace=True, chunksize=1024):
    chunk.columns = chunk.columns.str.lower() # to avoid problems with columns name it's better set lowercase
    chunk.to_sql(name='title_ratings', con=con, schema='public', if_exists='append', index=False)

Check num of rows

In [8]:
pd.read_sql_query(
        "SELECT COUNT(*) FROM title_ratings;", con)

     count
0  1258436

### Create DB with basics informations about films

In [9]:
title_basics_file = gzip.open('downloads/title.basics.tsv.gz','rb') # opening file

In [10]:
con.execute(f"""DROP TABLE IF EXISTS public.title_basics;
        CREATE TABLE if not exists public.title_basics (
        tconst character varying PRIMARY KEY,
        titletype character varying,
        primarytitle character varying,
        originaltitle character varying,
        isadult character varying,
        startyear character varying,
        endyear character varying,
        runtimeminutes character varying,
        genres character varying
        );
        """)

In [11]:
pd.read_sql_query(
        "SELECT column_name FROM information_schema.columns where table_name = 'title_basics';", con)

      column_name
0          tconst
1       titletype
2    primarytitle
3   originaltitle
4         isadult
5       startyear
6         endyear
7  runtimeminutes
8          genres

In [12]:
for chunk in pd.read_csv(title_basics_file, sep='\t', chunksize=1024):
    chunk.columns = chunk.columns.str.lower() # to avoid problems with columns name it's better set lowercase
    chunk.to_sql(name='title_basics', con=con, schema='public', if_exists='append', index=False)

Check how many rows

In [13]:
pd.read_sql_query(
        "SELECT COUNT(*) FROM title_basics;", con)

     count
0  9461196

### Create DB with informations about film principals (people which take part in film e.g. director)

In [14]:
title_principals_file = gzip.open('downloads/title.principals.tsv.gz','rb') # opening file

In [15]:
con.execute(f"""DROP TABLE IF EXISTS public.title_principals; 
        CREATE TABLE if not exists public.title_principals (
        tconst character varying,
        ordering character varying,
        nconst character varying,
        category character varying,
        job character varying,
        characters character varying,
        CONSTRAINT PK_principals PRIMARY KEY (tconst,ordering)
        );
        """)

In [16]:
pd.read_sql_query(
    "SELECT column_name FROM information_schema.columns where table_name = 'title_principals';", 
    con)

  column_name
0      tconst
1    ordering
2      nconst
3    category
4         job
5  characters

In [17]:
for chunk in pd.read_csv(title_principals_file, sep='\t', chunksize=1024):
    chunk.columns = chunk.columns.str.lower() # to avoid problems with columns name it's better set lowercase
    chunk.to_sql(name='title_principals', con=con, schema='public', if_exists='append', index=False)

Check how many rows

In [18]:
pd.read_sql_query(
        "SELECT COUNT(*) FROM title_principals;", con)

      count
0  53678047

### Create DB with informations names of crew (people which take part in film e.g. director, actor)

In [19]:
name_basics_file = gzip.open('downloads/name.basics.tsv.gz','rb') # opening file

In [20]:
con.execute(f"""DROP TABLE IF EXISTS public.name_basics; 
        CREATE TABLE if not exists public.name_basics (
        nconst character varying PRIMARY KEY,
        primaryname character varying,
        birthyear character varying,
        deathyear character varying,
        primaryprofession character varying,
        knownfortitles character varying
        );
        """)

In [21]:
pd.read_sql_query(
        "SELECT column_name FROM information_schema.columns where table_name = 'name_basics';", con)

         column_name
0             nconst
1        primaryname
2          birthyear
3          deathyear
4  primaryprofession
5     knownfortitles

In [22]:
for chunk in pd.read_csv(name_basics_file, sep='\t', chunksize=1024):
    chunk.columns = chunk.columns.str.lower() # to avoid problems with columns name it's better set lowercase
    chunk.to_sql(name='name_basics', con=con, schema='public', if_exists='append', index=False)

Check how many rows

In [23]:
pd.read_sql_query(
        "SELECT COUNT(*) FROM name_basics;", con)

      count
0  12164643